app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "description", "status", "priority", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        todo = user.todos.create(todo_params)

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 4], ["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Update todos"], ["updated_at", "2023-03-23 09:54:21.744474"], ["id", 1]]
---
    def update
        todo = user.todos.find(params[:id]).update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 4], ["id", 1], ["LIMIT", 1]]
---
    def destroy
        user.todos.find(params[:id]).destroy

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ?  [["user_id", 4]]
---
    def index
        todos = user.todos.all